In [11]:
import pandas as pd
df=pd.read_csv("Book1.csv")
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0   NaN
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [12]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False   True
3  False     False  False
4  False     False  False
5  False      True  False
6  False     False  False

### Exploring data

In [13]:
df.head()

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0   NaN
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

In [14]:
df.tail()

        city  humidity  temp
2        vzg      56.0   NaN
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [15]:
df.head(3)

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0   NaN

In [16]:
df.tail(3)

        city  humidity  temp
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      7 non-null      object
 1   humidity  6 non-null      float64
 2   temp      6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes

In [18]:
df.describe()

        humidity       temp
count   6.000000   6.000000
mean   45.000000  63.000000
std    19.677398  18.622567
min    23.000000  32.000000
25%    34.000000  58.750000
50%    39.500000  67.000000
75%    53.250000  67.000000
max    78.000000  89.000000

In [19]:
df.columns

Index(['city', 'humidity', 'temp'], dtype='object')

In [20]:
df.shape

(7, 3)

In [21]:
df['temp']=df['temp'].fillna(df['temp'].mean())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  bangalore      78.0  67.0

In [22]:
df['humidity']=df['humidity'].fillna(df['humidity'].sum())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [23]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [24]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [25]:
df.city

0          Hyd
1          kkd
2          vzg
3          Hyd
4          vzg
5          kkd
6    bangalore
Name: city, dtype: object

In [26]:
df.humidity

0     34.0
1     45.0
2     56.0
3     23.0
4     34.0
5    270.0
6     78.0
Name: humidity, dtype: float64

In [27]:
df[['city','humidity']]

        city  humidity
0        Hyd      34.0
1        kkd      45.0
2        vzg      56.0
3        Hyd      23.0
4        vzg      34.0
5        kkd     270.0
6  bangalore      78.0

In [28]:
df[2:5]

  city  humidity  temp
2  vzg      56.0  63.0
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

### creating a database

In [29]:
data=({
    "Name":["Niha","Kavs","Vinay","Sri","Sai","Sagarika","Raju"],
    "Age": [12,23,45,67,23,23,12]
})
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [30]:
df.head()

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0  63.0
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

In [31]:
df.tail()

        city  humidity  temp
2        vzg      56.0  63.0
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     270.0  67.0
6  bangalore      78.0  67.0

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      7 non-null      object
 1   humidity  7 non-null      float64
 2   temp      7 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes

In [33]:
df.describe()

         humidity  temp
count    7.000000   7.0
mean    77.142857  63.0
std     86.918407  17.0
min     23.000000  32.0
25%     34.000000  59.5
50%     45.000000  67.0
75%     67.000000  67.0
max    270.000000  89.0

In [34]:
df.shape

(7, 3)

In [35]:
df.columns

Index(['city', 'humidity', 'temp'], dtype='object')

In [36]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [37]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [38]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False  False
3  False     False  False
4  False     False  False
5  False     False  False
6  False     False  False